//* ESTO ES LA ESTRUCTURA DE DECLARACION DE IEFBR14    
//PASO01  EXEC PGM=IEFBR14                             
//VTAMOBJ  DD  DSN='HERC01.TEST.ARC',                  
//             SPACE=(TRK,(0)),                        
//             UNIT=3350,                              
//             DISP=(MOD,DELETE)                       
//* ESTO ES LA ESTRUCTURA DE NUESTRA PRIMER TARJETA JCL
/*                                                     
