//HERC01JN JOB (123),                                  
//             'JCL NUEVO',                            
//             CLASS=A,NOTIFY=HERC01,                  
//             MSGLEVEL=(1,1),                         
//             MSGCLASS=H,TIME=1440,                   
//             REGION=8M                               
//* ESTO ES LA ESTRUCTURA DE NUESTRA PRIMER TARJETA JCL
/*                                                     
